courses = ["Python-разработчик с нуля", "Java-разработчик с нуля", "Fullstack-разработчик на Python",
           "Frontend-разработчик с нуля"]

mentors = [
    ["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев",
     "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина", "Азамат Искаков",
     "Роман Гордиенко"],
    ["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев",
     "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский",
     "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов",
     "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
    ["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский",
     "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая", "Денис Ежков",
     "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
    ["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
     "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
]

def Mentors2courses():

    all_twin_courses = []
    name_twin_courses = []
    for id_с1 in range(len(courses)):

        # Тут заполним список имен из курса по id_с1
        list_name_c1 = []
        for fio in mentors[id_с1]:
            fio_list = fio.split(' ')
            list_name_c1.append(fio_list[0])

        for id_с2 in range(len(courses)):

            if id_с1 != id_с2:

                list_c = [courses[id_с1], courses[id_с2]]
                list_c.sort()

                # Тут заполним список имен из курса по id_с2
                list_name_c2 = []
                for fio in mentors[id_с2]:
                    fio_list = fio.split(' ')
                    list_name_c2.append(fio_list[0])

                if list_c not in all_twin_courses:
                    # Тут добавим в список уникальную пару курсов и сразу занесем для нее имена пересекающиеся
                    set_name = set(list_name_c1) & set(list_name_c2)
                    all_twin_courses.append(list_c)
                    name_twin_courses.append([[courses[id_с1], courses[id_с2]], list(set_name)])

    result = []
    for c in name_twin_courses:
        c[1].sort()
        result.append(f"На курсах '{c[0][0]}' и '{c[0][1]}' преподают: " + ', '.join(c[1]))

    return result

if __name__ == '__main__':
    result = Mentors2courses()
    for item in result:
        print(item)
